// Гра «Вгадай число». Запропонуй користувачеві загадати число від 0 до 100 і відгадай його
// наступним способом: кожну ітерацію циклу діли діапазон чисел навпіл, записуй результат в N і питай у користувача
//  «Ваше число> N, <N або == N?». Залежно від того що вказав користувач, зменшуй діапазон. Початковий діапазон від 0 до 100,
// поділи навпіл і отримай 50. Якщо користувач вказав, що його число> 50, то зміни діапазон на від 50 до 100.
//  І так до тих пір, поки користувач не вибере == N (буде корисним почитати про алгоритм: "бінарний пошук").
let range = 50;
let start = 50;

const num = prompt(`Буль даска, введіть число від 0 до 100`, 55); //можно і alert, оскільки ми число вгадуємо, і ці дані не потрібні для коду
let question = confirm(`Ваше число >= ${range}?`);

let i = 0;
while (i <= 5) {
  start /= 2;

  if (question === true) {
    question = confirm(`Ваше число > ${range + start}?`);
    range += start;
  } else {
    question = confirm(`Ваше число > ${range - start}?`);
    range -= start;
  }

  i++;
}

if (question === true) {
  alert(`Ваше число: ${Math.ceil(range)}`);
} else {
  alert(`Ваше число: ${Math.floor(range)}`);
}
